#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=7e60720e-8192-4576-893c-25f2000da1c6]
module.satire_bot.heroku_build.satire_bot: Refreshing state... [id=4e077427-6c8d-4760-9c9c-139682cc9dca]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.heroku_build.satire_bot has changed
  ~ resource "heroku_build" "satire_bot" {
        id                = "4e077427-6c8d-4760-9c9c-139682cc9dca"
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/4e/4e077427-6c8d-4760-9c9c-139682cc9dca.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T172502Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=a08fff0924b1e317bc4ec5269eb8356cf1250e963cf72e972a35de7170994a05" -> "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/4e/4e077427-6c8d-4760-9c9c-139682cc9dca.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T193242Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=fc4045af391dea8d52ff06bcc55ee8d9a45eab9f37ed794f20cd6caa965cb9e0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.satire_bot.heroku_build.satire_bot must be replaced
-/+ resource "heroku_build" "satire_bot" {
      ~ buildpacks        = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku/go.tgz",
        ] -> (known after apply)
      ~ id                = "4e077427-6c8d-4760-9c9c-139682cc9dca" -> (known after apply)
      ~ local_checksum    = "SHA256:89f39f8aef3ae2248c0eb907a1f4e815d690789fc549fc4acba3aa72705ddf40" -> "SHA256:0278eb9c6f3d45551918cd75e7ff8fd7135a736d1c6a52898637ed99189e297b" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/4e/4e077427-6c8d-4760-9c9c-139682cc9dca.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T193242Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=fc4045af391dea8d52ff06bcc55ee8d9a45eab9f37ed794f20cd6caa965cb9e0" -> (known after apply)
      ~ release_id        = "a3715817-fba4-40b8-a587-5c444acb7cbc" -> (known after apply)
      ~ slug_id           = "f5564796-f484-4033-92a8-d65f7f7dc74a" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "lucasyharada@gmail.com"
              - id    = "a3800f25-eaa7-417d-9b9d-5f3b7953685e"
            },
        ] -> (known after apply)
      ~ uuid              = "4e077427-6c8d-4760-9c9c-139682cc9dca" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Adarah, Action: `pull_request`, Working Directory: `infrastructure`, Workflow: `Verify`*